openfoam_cases/of_heat_sink/system/controlDict
FoamFile { version 2.0; format ascii; class dictionary; object controlDict; }
application     simpleFoam;
startFrom       startTime;
startTime       0;
stopAt          endTime;
endTime         2000;
deltaT          1;
writeControl    timeStep;
writeInterval   500;
purgeWrite      2;
writeFormat     ascii;
writePrecision  8;
writeCompression off;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
functions
{
    T
    {
        type            scalarTransport;
        libs            ("libsolverFunctionObjects.so");
        field           T;
        D               0.002;
        writeControl    writeTime;
    }
    pressureDrop
    {
        type            fieldValueDelta;
        libs            ("libfieldFunctionObjects.so");
        operation       subtract;
        writeControl    timeStep;
        writeInterval   50;
        log             true;
        region1 { type surfaceFieldValue; regionType patch; name inlet;
                  operation areaAverage; fields (p); writeFields false; }
        region2 { type surfaceFieldValue; regionType patch; name outlet;
                  operation areaAverage; fields (p); writeFields false; }
    }
    peakTemperature
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        regionType      all;
        operation       max;
        fields          (T);
        writeControl    timeStep;
        writeInterval   50;
        writeFields     false;
        log             true;
    }
}
