openfoam_cases/of_heat_sink/system/blockMeshDict
FoamFile { version 2.0; format ascii; class dictionary; object blockMeshDict; }
scale 1;
vertices
(
    (0 0 0) (4 0 0) (4 1 0) (0 1 0)
    (0 0 1) (4 0 1) (4 1 1) (0 1 1)
);
blocks
(
    hex (0 1 2 3 4 5 6 7) (80 20 20) simpleGrading (1 1 1)
);
edges ();
boundary
(
    inlet  { type patch; faces ((0 4 7 3)); }
    outlet { type patch; faces ((1 2 6 5)); }
    bottom { type wall;  faces ((0 1 5 4)); }
    top    { type wall;  faces ((3 7 6 2)); }
    sides  { type wall;  faces ((0 3 2 1) (4 5 6 7)); }
);
mergePatchPairs ();
